emacs/.config/emacs/config.org
#+title: Terminal Emacs Configuration
#+author: Ananth Madhavan
#+email: ananthmadhavan6@gmail.com
#+language: en
#+options: ':t toc:3
#+startup: overview indent

#+begin_quote
This is a /literate/ Emacs configuration optimized for full-time terminal use. All configuration is maintained
in this org file. To apply changes:

1. Edit this file (=config.org=)
2. Press =C-c C-v C-t= to tangle (generate =init.el= and =early-init.el=)
3. Restart Emacs or reload configuration

*Single Source of Truth:* This =config.org= is the master configuration.
Never edit =init.el= or =early-init.el= directly - they are auto-generated!
#+end_quote

* Table of Contents :TOC:
- [[#prerequisites][Prerequisites]]
- [[#early-initialization-early-initel][Early Initialization (early-init.el)]]
  - [[#performance-optimizations][Performance Optimizations]]
  - [[#terminal-compatibility][Terminal Compatibility]]
  - [[#keyboard-configuration][Keyboard Configuration]]
  - [[#ui-cleanup][UI Cleanup]]
  - [[#font-configuration][Font Configuration]]
- [[#bootstrap-package-manager][Bootstrap Package Manager]]
- [[#global-settings--sensible-defaults][Global Settings & Sensible Defaults]]
- [[#theme--appearance][Theme & Appearance]]
- [[#completion-framework][Completion Framework]]
- [[#enhanced-lsp-experience-vscode-level][Enhanced LSP Experience (VSCode-Level)]]
- [[#navigation--editing][Navigation & Editing]]
- [[#git-integration][Git Integration]]
- [[#keybinding-reference--tutorial][Keybinding Reference & Tutorial]]

* Prerequisites

This configuration requires several system-level tools to be installed:

** Essential Tools

#+begin_src sh :tangle no
# TypeScript Language Server (CRITICAL for LSP)
brew install typescript-language-server

# Fast search tools
brew install ripgrep fd

# Code formatting
npm install -g prettier eslint

# Terminal (already installed)
# brew install ghostty
#+end_src

** Emacs Installation

#+begin_src sh :tangle no
brew tap d12frosted/emacs-plus
brew install emacs-plus@30 --with-native-comp
#+end_src

** Font Installation

#+begin_src sh :tangle no
brew install font-jetbrains-mono
brew install font-jetbrains-mono-nerd-font
#+end_src

* Early Initialization (early-init.el)

These customizations load during Emacs startup, before the main init file.
They optimize startup time and configure terminal compatibility.

** Performance Optimizations

Temporarily increase garbage collection threshold for faster startup.
This will be reset by =gcmh-mode= later in =init.el=.

#+begin_src emacs-lisp :tangle "early-init.el"
  ;;; early-init.el --- Early initialization -*- lexical-binding: t -*-

  ;; Increase GC threshold for faster startup
  (setq gc-cons-threshold most-positive-fixnum)

  ;; Prefer newest version of files
  (setq load-prefer-newer t)
#+end_src

** Terminal Compatibility

Disable package.el since we use Elpaca as our package manager.

#+begin_src emacs-lisp :tangle "early-init.el"
  ;; Disable package.el (we use Elpaca)
  (setq package-enable-at-startup nil)
  (setq-default package-quickstart nil)
#+end_src

** UI Cleanup

Remove GUI elements that don't work in terminal or are unnecessary.

#+begin_src emacs-lisp :tangle "early-init.el"
  ;; Disable unwanted UI elements
  (push '(menu-bar-lines . 0) default-frame-alist)
  (push '(tool-bar-lines . 0) default-frame-alist)
  (push '(vertical-scroll-bars . nil) default-frame-alist)

  ;; Unset file-name-handler-alist for faster startup
  (setq file-name-handler-alist nil)
#+end_src

** Keyboard Configuration

Terminal-aware keyboard modifier configuration. In GUI mode, ⌘ acts as Meta.
In terminal mode, Option key is configured via Ghostty to send Alt (which Emacs treats as Meta).

#+begin_src emacs-lisp :tangle "early-init.el"
  ;; Keyboard modifiers (terminal-aware)
  ;; In GUI: use ⌘ as meta, ⌥ as super
  (when (display-graphic-p)
    (defvar mac-option-key-is-meta nil)
    (defvar mac-command-key-is-meta t)
    (setq mac-command-modifier 'meta
          mac-option-modifier 'super))

  ;; In terminal: Option/Alt is automatically Meta
  ;; Ghostty config (macos-option-as-alt = true) handles this
  ;; No Emacs configuration needed
#+end_src

** Additional Optimizations

#+begin_src emacs-lisp :tangle "early-init.el"
  ;; Disable bidirectional text rendering for performance
  (setq-default bidi-display-reordering 'left-to-right
                bidi-paragraph-direction 'left-to-right)

  ;; Remove CLI opts that aren't relevant to current OS
  (unless (eq system-type 'darwin)
    (setq command-line-ns-option-alist nil))
  (unless (eq system-type 'gnu/linux)
    (setq command-line-x-option-alist nil))

  ;; Native compilation cache
  ;; Emacs 30 can expose the function before native-comp state is initialized.
  (when (and (fboundp 'startup-redirect-eln-cache)
             (boundp 'native-comp-eln-load-path))
    (startup-redirect-eln-cache
     (expand-file-name "~/.cache/emacs/")))

  ;; Inhibit implied resize for faster startup
  (setq frame-inhibit-implied-resize t)
#+end_src

** Font Configuration

#+begin_src emacs-lisp :tangle "early-init.el"
  ;; Set JetBrains Mono font (works in both GUI and terminal)
  (set-face-attribute 'default nil
                      :family "JetBrains Mono"
                      :height 130
                      :weight 'regular)

  ;;; early-init.el ends here
#+end_src

* Bootstrap Package Manager

Install and configure Elpaca, our package manager.

#+begin_src emacs-lisp :tangle "init.el"
  ;;; init.el --- Main configuration -*- lexical-binding: t -*-

  ;; Bootstrap Elpaca
  (defvar elpaca-installer-version 0.12)
  (defvar elpaca-directory (expand-file-name "elpaca/" user-emacs-directory))
  (defvar elpaca-builds-directory (expand-file-name "builds/" elpaca-directory))
  (defvar elpaca-repos-directory (expand-file-name "repos/" elpaca-directory))
  (defvar elpaca-order '(elpaca :repo "https://github.com/progfolio/elpaca.git"
                                :ref nil :depth 1 :inherit ignore
                                :files (:defaults "elpaca-test.el" (:exclude "extensions"))
                                :build (:not elpaca--activate-package)))
  (let* ((repo  (expand-file-name "elpaca/" elpaca-repos-directory))
         (build (expand-file-name "elpaca/" elpaca-builds-directory))
         (order (cdr elpaca-order))
         (default-directory repo))
    (add-to-list 'load-path (if (file-exists-p build) build repo))
    (unless (file-exists-p repo)
      (make-directory repo t)
      (when (< emacs-major-version 28) (require 'subr-x))
      (condition-case-unless-debug err
          (if-let* ((buffer (pop-to-buffer-same-window "*elpaca-bootstrap*"))
                    ((zerop (apply #'call-process `("git" nil ,buffer t "clone"
                                                    ,@(when-let* ((depth (plist-get order :depth)))
                                                        (list (format "--depth=%d" depth) "--no-single-branch"))
                                                    ,(plist-get order :repo) ,repo))))
                    ((zerop (call-process "git" nil buffer t "checkout"
                                          (or (plist-get order :ref) "--"))))
                    (emacs (concat invocation-directory invocation-name))
                    ((zerop (call-process emacs nil buffer nil "-Q" "-L" "." "--batch"
                                          "--eval" "(byte-recompile-directory \".\" 0 'force)")))
                    ((require 'elpaca))
                    ((elpaca-generate-autoloads "elpaca" repo)))
              (progn (message "%s" (buffer-string)) (kill-buffer buffer))
            (error "%s" (with-current-buffer buffer (buffer-string))))
        ((error) (warn "%s" err) (delete-directory repo 'recursive))))
    (unless (require 'elpaca-autoloads nil t)
      (require 'elpaca)
      (elpaca-generate-autoloads "elpaca" repo)
      (load "./elpaca-autoloads")))
  (add-hook 'after-init-hook #'elpaca-process-queues)
  (elpaca `(,@elpaca-order))

  ;; Install use-package integration
  (setq use-package-enable-imenu-support t)
  (elpaca elpaca-use-package
    (elpaca-use-package-mode))
  (setq use-package-always-ensure t)
  (use-package use-package-core
    :ensure nil
    :custom (use-package-always-defer t))
#+end_src

* Global Settings & Sensible Defaults

** Garbage Collection Management

#+begin_src emacs-lisp :tangle "init.el"
  (use-package gcmh
    :init (gcmh-mode t))
#+end_src

** Custom File Configuration

Send customizations to null device to keep init files clean.

#+begin_src emacs-lisp :tangle "init.el"
  (use-package cus-edit
    :ensure nil
    :custom (custom-file null-device))
#+end_src

** GUI-Only Features

These features only work in GUI mode and are wrapped accordingly.

#+begin_src emacs-lisp :tangle "init.el"
  ;; transparent titlebar synced to current theme (GUI only)
  (when (display-graphic-p)
    (use-package ns-auto-titlebar
      :hook (elpaca-after-init . ns-auto-titlebar-mode)))
#+end_src

** Improved Keyboard Quit

Better =keyboard-quit= behavior from Protesilaos Stavrou's config.

#+begin_src emacs-lisp :tangle "init.el"
  (defun keyboard-quit-dwim ()
    "Do-What-I-Mean behaviour for a general `keyboard-quit'.

  The generic `keyboard-quit' does not do the expected thing when
  the minibuffer is open.  Whereas we want it to close the
  minibuffer, even without explicitly focusing it.

  The DWIM behaviour of this command is as follows:

  - When the region is active, disable it.
  - When a minibuffer is open, but not focused, close the minibuffer.
  - When the Completions buffer is selected, close it.
  - In every other case use the regular `keyboard-quit'."
    (interactive)
    (cond
     ((region-active-p)
      (keyboard-quit))
     ((derived-mode-p 'completion-list-mode)
      (delete-completion-window))
     ((> (minibuffer-depth) 0)
      (abort-recursive-edit))
     (t
      (keyboard-quit))))

  (define-key (current-global-map) [remap keyboard-quit] 'keyboard-quit-dwim)
#+end_src

