emacs/.config/emacs/init.el

;; Keep emacs directory clean
(use-package no-littering
  :demand t
  :init
  (setq no-littering-etc-directory
      (expand-file-name "~/.local/share/emacs/"))
  (setq no-littering-var-directory
      (expand-file-name "~/.local/state/emacs/"))
  :config (no-littering-theme-backups))

;; Exclude all files in no-littering directories from recentf
(use-package recentf
  :ensure nil
  :config
  (add-to-list 'recentf-exclude
               (recentf-expand-file-name no-littering-var-directory))
  (add-to-list 'recentf-exclude
               (recentf-expand-file-name no-littering-etc-directory))
  :hook (elpaca-after-init . recentf-mode))

(use-package savehist
  :ensure nil
  :hook (elpaca-after-init . savehist-mode))

;; Disable initial splash screen
(use-package startup
  :ensure nil
  :preface (defun display-startup-echo-area-message ()
             (message nil))
  :custom
  (inhibit-startup-screen t)
  (initial-scratch-message nil)
  (initial-major-mode 'fundamental-mode))

;; Configure stuff that's present in native code
(use-package emacs
  :ensure nil
  :config
  (fset 'yes-or-no-p 'y-or-n-p)
  :custom
  (ring-bell-function 'ignore)
  (completion-cycle-threshold 1)
  (tab-always-indent 'complete)
  (read-extended-command-predicate #'command-completion-default-include-p)
  (vc-follow-symlinks t)
  (vc-make-backup-files nil))

(use-package epg-config
  :ensure nil
  :custom (epg-pinentry-mode 'loopback))

(use-package jka-cmpr-hook
  :ensure nil
  :hook (elpaca-after-init . auto-compression-mode))

;; set fringe-mode to minimal
(use-package fringe
  :ensure nil
  :config
  (set-fringe-mode '(1 . 1)))

(use-package display-line-numbers
  :ensure nil
  :custom (display-line-numbers-width-start t)
  :hook (elpaca-after-init . global-display-line-numbers-mode))

;; Enable syntax highlighting globally
(use-package font-lock
  :ensure nil
  :config (global-font-lock-mode 1))

;; Allow loading themes without confirmation
(use-package custom
  :ensure nil
  :custom (custom-safe-themes t))

;; install prot's amazing ef-themes packages
(use-package ef-themes
  :demand t
  :config
  ;; set light and dark themes
  (setq light-theme 'ef-frost)
  (setq dark-theme 'ef-owl)

  ;; apply theme based on the system appearance
  (defun apply-theme (appearance)
    (mapc #'disable-theme custom-enabled-themes)
    (pcase appearance
      ('light (load-theme light-theme t))
      ('dark (load-theme dark-theme t))))

  ;; GUI: auto-switch based on macOS system appearance
  (when (display-graphic-p)
    (add-hook 'ns-system-appearance-change-functions #'apply-theme))

  ;; Terminal: detect system appearance on startup
  (unless (display-graphic-p)
    (let* ((output (shell-command-to-string "defaults read -g AppleInterfaceStyle 2>/dev/null"))
           (is-dark (string-match-p "Dark" output)))
      (if is-dark
          (load-theme dark-theme t)
        (load-theme light-theme t)))))

(use-package ligature
  :ensure (ligature
           :host github
           :repo "mickeynp/ligature.el")
  :init (global-ligature-mode)
  :config
  (global-ligature-mode)
  (ligature-set-ligatures
   'prog-mode '("-|" "-~" "---" "-<<" "-<" "--" "->" "->>" "-->" "///" "/=" "/=="
                "/>" "//" "/*" "*>" "***" "*/" "<-" "<<-" "<=>" "<=" "<|" "<||"
                "<|||" "<|>" "<:" "<>" "<-<" "<<<" "<==" "<<=" "<=<" "<==>" "<-|"
                "<<" "<~>" "<=|" "<~~" "<~" "<$>" "<$" "<+>" "<+" "</>" "</" "<*"
                "<*>" "<->" "<!--" ":>" ":<" ":::" "::" ":?" ":?>" ":=" "::=" "=>>"
                "==>" "=/=" "=!=" "=>" "===" "=:=" "==" "!==" "!!" "!=" ">]" ">:"
                ">>-" ">>=" ">=>" ">>>" ">-" ">=" "&&&" "&&" "|||>" "||>" "|>" "|]"
                "|}" "|=>" "|->" "|=" "||-" "|-" "||=" "||" ".." ".?" ".=" ".-" "..<"
                "..." "+++" "+>" "++" "[||]" "[<" "[|" "{|" "??" "?." "?=" "?:" "##"
                "###" "####" "#[" "#{" "#=" "#!" "#:" "#_(" "#_" "#?" "#(" ";;" "_|_"
                "__" "~~" "~~>" "~>" "~-" "~@" "$>" "^=" "]#")))

(use-package mood-line
  :hook (elpaca-after-init . mood-line-mode))

(use-package which-key
  :hook (elpaca-after-init . which-key-mode)
  :custom (which-key-show-transient-maps t)
  :config (which-key-setup-side-window-bottom))

(use-package helpful
  :bind
  (:map help-map
        ("f" . helpful-callable)
        ("v" . helpful-variable)
        ("k" . helpful-key)
        ("x" . helpful-command))
  (:map mode-specific-map
        ("C-d" . helpful-at-point)))

;; keep the buffer up-to-date
(use-package autorevert
  :ensure nil
  :hook (elpaca-after-init . global-auto-revert-mode))

;; smooth scrolling
(use-package ultra-scroll
  :ensure (ultra-scroll
           :host github
           :repo "jdtsmith/ultra-scroll")
  :custom
  (scroll-conservatively 101)
  (scroll-margin 0)
  :config (ultra-scroll-mode 1))
