emacs/.config/emacs/config.org
** Terminal-Specific Enhancements

#+begin_src emacs-lisp :tangle "init.el"
  (use-package clipetty
    :if (and (not (display-graphic-p))
             (not (eq system-type 'darwin)))
    :hook (after-init . global-clipetty-mode))

  (defun am/setup-terminal-clipboard (&optional frame)
    "Configure reliable clipboard integration for terminal FRAME."
    (unless (display-graphic-p frame)
      ;; Enable mouse support in terminal
      (xterm-mouse-mode 1)
      (global-set-key (kbd "<mouse-4>") 'scroll-down-line)
      (global-set-key (kbd "<mouse-5>") 'scroll-up-line)

      ;; Better terminal colors
      (setq xterm-set-window-title t)

      ;; Clipboard integration
      (setq select-enable-clipboard t
            select-enable-primary t
            save-interprogram-paste-before-kill t)

      ;; On macOS terminals, use system clipboard commands directly.
      ;; This is more reliable than terminal escape-sequence clipboard bridges.
      (when (and (eq system-type 'darwin)
                 (executable-find "pbcopy")
                 (executable-find "pbpaste"))
        (setq interprogram-cut-function
              (lambda (text &optional _push)
                (let ((process-connection-type nil))
                  (let ((proc (start-process "pbcopy" nil "pbcopy")))
                    (process-send-string proc text)
                    (process-send-eof proc))))
              interprogram-paste-function
              (lambda ()
                (string-trim-right (shell-command-to-string "pbpaste")))))))

  (defun am/pbcopy-on-kill-new (text &rest _)
    "Mirror killed TEXT to macOS clipboard in terminal Emacs."
    (when (and (not (display-graphic-p))
               (eq system-type 'darwin)
               (stringp text)
               (executable-find "pbcopy"))
      (let ((process-connection-type nil))
        (let ((proc (start-process "pbcopy" nil "pbcopy")))
          (process-send-string proc text)
          (process-send-eof proc)))))

  (defun am/pbpaste-string ()
    "Return current macOS clipboard text, or nil if unavailable."
    (when (and (not (display-graphic-p))
               (eq system-type 'darwin)
               (executable-find "pbpaste"))
      (string-trim-right (shell-command-to-string "pbpaste"))))

  (defun am/sync-kill-ring-from-pbpaste (&rest _)
    "Sync kill-ring with macOS clipboard before paste commands."
    (let ((clip (am/pbpaste-string)))
      (when (and (stringp clip)
                 (not (string-empty-p clip)))
        (kill-new clip))))

  ;; Apply once at startup and again for any new terminal frames (daemon/client).
  (add-hook 'after-init-hook #'am/setup-terminal-clipboard)
  (add-hook 'after-make-frame-functions #'am/setup-terminal-clipboard)
  (advice-add 'kill-new :after #'am/pbcopy-on-kill-new)
  (advice-add 'yank :before #'am/sync-kill-ring-from-pbpaste)
  (advice-add 'yank-pop :before #'am/sync-kill-ring-from-pbpaste)
#+end_src

* Completion Framework

Modern completion using Vertico, Consult, Orderless, and Marginalia.

#+begin_src emacs-lisp :tangle "init.el"
  (use-package orderless
    :custom
    (completion-styles '(orderless basic))
    (completion-category-overrides '((file (styles basic partial-completion)))))

  (use-package consult
    :init
    (advice-add #'completing-read-multiple :override #'consult-completing-read-multiple)
    (setq xref-show-xrefs-function #'consult-xref
          xref-show-definitions-function #'consult-xref)
    :bind
    ([remap isearch-forward] . consult-line)
    ([remap yank-pop] . consult-yank-pop)
    (:map mode-specific-map
          ("h" . consult-history))
    (:map ctl-x-map
          ("b" . consult-buffer)
          ("4 b" . consult-buffer-other-window)
          ("5 b" . consult-buffer-other-frame)
          ("p b" . consult-project-buffer))
    (:map goto-map
          ("i" . consult-imenu)
          ("b" . consult-buffer)
          ("g" . consult-goto-line)
          ("o" . consult-outline)
          ("m" . consult-mark))
    (:map search-map
          ("s" . consult-ripgrep)))

  (use-package consult-dir
    :after consult
    :bind
    (:map ctl-x-map
          ("C-d" . consult-dir))
    (:map vertico-map
          ("C-x C-d" . consult-dir)
          ("C-x C-j" . consult-dir-jump-file)))

  (use-package consult-project-extra
    :after consult
    :bind
    ([remap project-find-file] . consult-project-extra-find)
    (:map project-prefix-map
          ("4 f" . consult-project-extra-find-other-window)))

  (use-package vertico
    :ensure (:files (:defaults "extensions/*")
                    :includes (vertico-indexed
                               vertico-multiform))
    :custom
    (vertico-resize t)
    (vertico-count 10)
    (vertico-multiform-categories '((t indexed)))
    (vertico-multiform-commands '((consult-flymake)
                                  (consult-line)
                                  (consult-ripgrep)
                                  (consult-lsp-diagnostics)
                                  (consult-yank-pop indexed)
                                  (project-find-regexp)
                                  (xref-find-definitions)
                                  (xref-find-references)))
    :hook (elpaca-after-init . vertico-mode)
    :config
    (vertico-multiform-mode))

  ;; Company mode for auto-completion (better terminal support)
  (use-package company
    :custom
    (company-idle-delay 0.1)
    (company-minimum-prefix-length 2)
    (company-selection-wrap-around t)
    (company-show-quick-access t)
    (company-tooltip-align-annotations t)
    :init (global-company-mode)
    :bind (:map company-active-map
                ("C-n" . company-select-next)
                ("C-p" . company-select-previous)
                ("<tab>" . company-complete-selection)))

  (use-package marginalia
    :hook (elpaca-after-init . marginalia-mode)
    :custom
    (marginalia-max-relative-age 0)
    (marginalia-align 'right)
    (marginalia-annotators
     '(marginalia-annotators-heavy marginalia-annotators-light nil)))
#+end_src

* Enhanced LSP Experience (VSCode-Level)

** Better Completion with Icons and Documentation

#+begin_src emacs-lisp :tangle "init.el"
  ;; Company backends for additional completions
  (use-package company
    :ensure nil
    :config
    ;; Enable company in all programming modes
    (add-hook 'prog-mode-hook #'company-mode)
    ;; Add file completion backend
    (add-to-list 'company-backends 'company-files))
#+end_src

** Code Snippets

#+begin_src emacs-lisp :tangle "init.el"
  (use-package yasnippet
    :hook (prog-mode . yas-minor-mode)
    :config
    (yas-reload-all))

  (use-package yasnippet-snippets
    :after yasnippet)
#+end_src

** Hover Documentation

#+begin_src emacs-lisp :tangle "init.el"
  (use-package eldoc-box
    :bind ("C-c l h" . eldoc-box-help-at-point)
    :custom
    (eldoc-box-max-pixel-width 800)
    (eldoc-box-max-pixel-height 600))
#+end_src

** Error Display

#+begin_src emacs-lisp :tangle "init.el"
  ;; Quick error navigation with consult
  (with-eval-after-load 'consult
    (global-set-key (kbd "C-c ! l") #'consult-flymake))

  ;; Quick error navigation keybindings
  (with-eval-after-load 'flymake
    (define-key flymake-mode-map (kbd "C-c ! n") #'flymake-goto-next-error)
    (define-key flymake-mode-map (kbd "C-c ! p") #'flymake-goto-prev-error))
#+end_src

* Navigation & Editing

