emacs/.config/emacs/config.org
** Moving & Editing Capabilities

#+begin_src emacs-lisp :tangle "init.el"
   (use-package expand-region
     :bind
     ("C-=" . er/expand-region)
     ("C-_" . er/contract-region))

  (use-package vundo
    :custom
    (vundo-compact-display nil)
    (vundo-glyph-alist vundo-unicode-symbols))

   ;; save cursor postion
   (use-package saveplace
     :ensure nil
     :hook (elpaca-after-init . save-place-mode))

   (use-package whitespace
     :ensure nil
     :hook (before-save . whitespace-cleanup))

   ;; Replace active region with what I type
   (use-package delsel
     :ensure nil
     :hook (elpaca-after-init . delete-selection-mode))

   (use-package whole-line-or-region
     :config (whole-line-or-region-global-mode t))

   (use-package diff-hl
     :hook
     (prog-mode . diff-hl-margin-mode)
     (magit-post-refresh . diff-hl-magit-post-refresh))

   (use-package indent
     :ensure nil
     :custom (standard-indent 2))

   (use-package mwim
     :bind (([remap move-beginning-of-line] . mwim-beginning)
            ([remap move-end-of-line] . mwim-end)))

   (use-package goto-last-change
     :bind ("C-z" . goto-last-change))

   (use-package elec-pair
     :ensure nil
     :hook (elpaca-after-init . electric-pair-mode))

   (use-package move-text
     :demand t
     :init (move-text-default-bindings))

   (use-package paren
     :ensure nil
     :hook (prog-mode . show-paren-mode))

   (use-package subword
     :ensure nil
     :hook (prog-mode . subword-mode))

   (use-package hl-line
     :ensure nil
     :hook (prog-mode . hl-line-mode))

   (use-package smart-comment
     :bind (:map esc-map (";" . smart-comment)))

   (use-package hide-comnt
     :ensure (hide-comnt
              :host github
              :repo "emacsmirror/hide-comnt"))

   (use-package newcomment
     :ensure nil
     :custom
     (fill-column 80)
     (comment-auto-fill-only-comments 1)
     (auto-fill-function 'do-auto-fill))

   (use-package dumb-jump
     :init (add-hook 'xref-backend-functions #'dumb-jump-xref-activate)
     :custom
     (dumb-jump-selector 'completing-read)
     (dumb-jump-force-searcher 'rg)
     (dumb-jump-prefer-searcher 'rg))

   ;; avy for jumping to place
   (use-package avy
     :bind
     ("C-j" . avy-goto-char-timer)
     (:map goto-map
           ("M-g" . avy-goto-line)))

   (use-package avy-zap
     :bind ([remap zap-to-char] . avy-zap-to-char))

  ;; auto-resize windows while switching using the golden-ratio
  (use-package golden-ratio
    :custom
    (golden-ratio-exclude-modes '("vundo-mode"
                                "which-key-mode"))
    (golden-ratio-exclude-buffer-names '("*Warnings*"))
    :hook (elpaca-after-init . golden-ratio-mode))

  (use-package ace-window
    :after golden-ratio
    :config (add-to-list 'golden-ratio-extra-commands 'ace-window)
    :bind (:map esc-map ("o" . ace-window)))

   (use-package hungry-delete
     :hook
     (text-mode . hungry-delete-mode)
     (prog-mode . hungry-delete-mode))

   ;; Multiple cursors (terminal-compatible)
   (use-package multiple-cursors
     :bind
     (:map esc-map ("RET" . mc/edit-lines)))
   ;; Note: s-<mouse-1> removed - doesn't work in terminal
   ;; Use M-RET (Option+Return) instead

   (use-package copy-as-format
     :bind
     (:map mode-specific-map
           :prefix-map copy-as-format-prefix-map
           :prefix "w"
           ("g" . copy-as-format-github)
           ("s" . copy-as-format-slack)
           ("m" . copy-as-format-markdown)
           ("h" . copy-as-format-html)
           ("j" . copy-as-format-jira)
           ("o" . copy-as-format-org-mode)))
#+end_src

** Enhanced Navigation for Code

#+begin_src emacs-lisp :tangle "init.el"
  ;; consult-eglot for LSP symbol search
  (use-package consult-eglot
    :after (consult eglot)
    :bind (:map eglot-mode-map
                ("C-c l s" . consult-eglot-symbols)))

  ;; Breadcrumb showing current function/class
  (use-package breadcrumb
    :hook (prog-mode . breadcrumb-mode))

  ;; dired enhancements
  (use-package dired-subtree
    :after dired
    :bind (:map dired-mode-map
                ("TAB" . dired-subtree-toggle)
                ("<backtab>" . dired-subtree-cycle)))

  ;; File tree sidebar
  (use-package dired-sidebar
    :commands (dired-sidebar-toggle-sidebar)
    :bind ("C-c d" . dired-sidebar-toggle-sidebar)
    :custom
    (dired-sidebar-width 35)
    (dired-sidebar-theme 'none))

  ;; Tab bar for multiple projects
  (use-package tab-bar
    :ensure nil
    :custom
    (tab-bar-show 1)
    (tab-bar-close-button-show nil)
    (tab-bar-new-button-show nil)
    (tab-bar-tab-hints t)
    :bind (("C-c w n" . tab-bar-new-tab)
           ("C-c w c" . tab-bar-close-tab)
           ("C-c w r" . tab-bar-rename-tab)))
#+end_src

* Git Integration

#+begin_src emacs-lisp :tangle "init.el"
   (use-package auth-source
     :ensure nil
     :custom (auth-sources '("~/.authinfo")))

   (use-package transient)

   (use-package magit
     :custom
     (magit-diff-refine-hunk t)
     (magit-git-executable "/opt/homebrew/bin/git")
     :bind (:map mode-specific-map
                 :prefix-map magit-prefix-map
                 :prefix "m"
                 ("s" . magit-status)
                 ("b" . magit-blame)
                 ("l" . magit-log)))

   (use-package forge
     :after magit)

  ;; git-timemachine for file history
  (use-package git-timemachine
    :bind ("C-c g t" . git-timemachine))

  ;; blamer for inline git blame (GitLens-like)
  (use-package blamer
    :custom
    (blamer-idle-time 0.5)
    (blamer-min-offset 70)
    (blamer-prettify-time-p t)
    (blamer-author-formatter "  %s ")
    (blamer-datetime-formatter "[%s]")
    (blamer-commit-formatter " • %s")
    :bind (("C-c g b" . blamer-mode)
           ("C-c g B" . blamer-show-commit-info)))

   ;; get github link at point
   (use-package git-link)
#+end_src

* Programming Languages & LSP

** Org Mode Configuration

#+begin_src emacs-lisp :tangle "init.el"
  (use-package org
    :ensure nil
    :custom
    (org-hide-emphasis-markers t))

  (use-package org-modern
    :hook (elpaca-after-init . global-org-modern-mode))

  (use-package org-modern-indent
    :ensure (org-modern-indent
             :host github
             :repo "jdtsmith/org-modern-indent")
    :config
    (add-hook 'org-mode-hook #'org-modern-indent-mode 90))

#+end_src

