emacs/.config/emacs/init.el
(use-package zig-mode)
(use-package nix-mode)
(use-package fountain-mode)
(use-package typescript-mode)

(use-package treesit
  :ensure nil
  :init
  (setq treesit-language-source-alist
        '((css . ("https://github.com/tree-sitter/tree-sitter-css"))
          (dockerfile . ("https://github.com/camdencheek/tree-sitter-dockerfile"))
          (go . ("https://github.com/tree-sitter/tree-sitter-go"))
          (html . ("https://github.com/tree-sitter/tree-sitter-html"))
          (javascript . ("https://github.com/tree-sitter/tree-sitter-javascript"))
          (json . ("https://github.com/tree-sitter/tree-sitter-json"))
          (nix . ("https://github.com/nix-community/tree-sitter-nix"))
          (typescript . ("https://github.com/tree-sitter/tree-sitter-typescript" "master" "typescript/src"))
          (tsx . ("https://github.com/tree-sitter/tree-sitter-typescript" "master" "tsx/src"))
          (ruby . ("https://github.com/tree-sitter/tree-sitter-ruby"))
          (python . ("https://github.com/tree-sitter/tree-sitter-python"))
          (yaml . ("https://github.com/ikatyang/tree-sitter-yaml"))
          (zig . ("https://github.com/tree-sitter-grammars/tree-sitter-zig"))))
  :config
  (defconst am/treesit-required-languages
    '(css dockerfile go html javascript json nix python ruby tsx typescript yaml zig))

  (defun am/treesit-ready-p (language)
    "Return non-nil when LANGUAGE grammar is available."
    (and (fboundp 'treesit-available-p)
         (treesit-available-p)
         (treesit-language-available-p language)))

  (defun am/treesit-toolchain-ready-p ()
    "Return non-nil when local tools can build grammars."
    (and (executable-find "git")
         (or (executable-find "cc")
             (executable-find "clang")
             (executable-find "gcc"))))

  (defun am/treesit-missing-languages ()
    "Return configured grammars not yet available."
    (seq-filter
     (lambda (language) (not (am/treesit-ready-p language)))
     am/treesit-required-languages))

  (defun am/configure-treesit-modes ()
    "Prefer tree-sitter modes for languages with installed grammars."
    (setq auto-mode-alist
          (seq-remove
           (lambda (entry)
             (member (cdr entry)
                     '(typescript-ts-mode tsx-ts-mode js-ts-mode json-ts-mode yaml-ts-mode)))
           auto-mode-alist))

    (when (am/treesit-ready-p 'typescript)
      (add-to-list 'auto-mode-alist '("\\.ts\\'" . typescript-ts-mode)))
    (when (am/treesit-ready-p 'tsx)
      (add-to-list 'auto-mode-alist '("\\.tsx\\'" . tsx-ts-mode)))
    (when (am/treesit-ready-p 'javascript)
      (add-to-list 'auto-mode-alist '("\\.js\\'" . js-ts-mode))
      (add-to-list 'auto-mode-alist '("\\.jsx\\'" . js-ts-mode)))
    (when (am/treesit-ready-p 'json)
      (add-to-list 'auto-mode-alist '("\\.json\\'" . json-ts-mode)))
    (when (am/treesit-ready-p 'yaml)
      (add-to-list 'auto-mode-alist '("\\.ya?ml\\'" . yaml-ts-mode)))

    (setq major-mode-remap-alist nil)
    (when (am/treesit-ready-p 'yaml)
      (add-to-list 'major-mode-remap-alist '(yaml-mode . yaml-ts-mode)))
    (when (am/treesit-ready-p 'css)
      (add-to-list 'major-mode-remap-alist '(css-mode . css-ts-mode)))
    (when (am/treesit-ready-p 'typescript)
      (add-to-list 'major-mode-remap-alist '(typescript-mode . typescript-ts-mode)))
    (when (am/treesit-ready-p 'dockerfile)
      (add-to-list 'major-mode-remap-alist '(dockerfile-mode . dockerfile-ts-mode)))
    (when (am/treesit-ready-p 'javascript)
      (add-to-list 'major-mode-remap-alist '(javascript-mode . js-ts-mode)))
    (when (am/treesit-ready-p 'json)
      (add-to-list 'major-mode-remap-alist '(json-mode . json-ts-mode)))
    (when (am/treesit-ready-p 'ruby)
      (add-to-list 'major-mode-remap-alist '(ruby-mode . ruby-ts-mode)))
    (when (am/treesit-ready-p 'python)
      (add-to-list 'major-mode-remap-alist '(python-mode . python-ts-mode)))
    (when (am/treesit-ready-p 'html)
      (add-to-list 'major-mode-remap-alist '(html-mode . html-ts-mode))))

  (defun am/treesit-install-missing-grammars ()
    "Install missing configured tree-sitter grammars."
    (interactive)
    (let ((missing (am/treesit-missing-languages)))
      (when missing
        (unless (am/treesit-toolchain-ready-p)
          (user-error "Missing git/compiler toolchain for tree-sitter grammar builds"))
        (message "Installing tree-sitter grammars: %s"
                 (mapconcat #'symbol-name missing ", "))
        (dolist (language missing)
          (treesit-install-language-grammar language))
        (am/configure-treesit-modes)
        (message "Tree-sitter grammars installed"))))

  (setq treesit-font-lock-level 4)
  (am/configure-treesit-modes)
  (add-hook 'elpaca-after-init #'am/treesit-install-missing-grammars))

(use-package eglot
  :ensure nil
  :init
  (fset #'jsonrpc--log-event #'ignore)
  :hook
  (typescript-mode . eglot-ensure)
  (typescript-ts-mode . eglot-ensure)
  (tsx-ts-mode . eglot-ensure)
  (go-ts-mode . eglot-ensure)
  (js-ts-mode . eglot-ensure)
  (nix-mode . eglot-ensure)
  (ruby-ts-mode . eglot-ensure)
  (json-ts-mode . eglot-ensure)
  (yaml-ts-mode . eglot-ensure)
  (dockerfile-ts-mode . eglot-ensure)
  (css-ts-mode . eglot-ensure)
  (html-ts-mode . eglot-ensure)
  (zig-mode . eglot-ensure)
  :config
  (remove-hook 'eldoc-display-functions 'eldoc-display-in-echo-area)
  ;; Use servers discovered in PATH for portability across machines.
  (when-let ((zls (executable-find "zls")))
    (add-to-list 'eglot-server-programs `(zig-mode . (,zls))))
  (when-let ((nil-ls (executable-find "nil")))
    (add-to-list 'eglot-server-programs `(nix-mode . (,nil-ls)))))

;; Enhanced eglot configuration
(with-eval-after-load 'eglot
  ;; Keybindings
  (define-key eglot-mode-map (kbd "C-c l a") #'eglot-code-actions)
  (define-key eglot-mode-map (kbd "C-c l r") #'eglot-rename)
  (define-key eglot-mode-map (kbd "C-c l o") #'eglot-code-action-organize-imports)
  (define-key eglot-mode-map (kbd "C-c l f") #'eglot-format)
  (define-key eglot-mode-map (kbd "C-c l d") #'eldoc-box-help-at-point)

  ;; Performance for large projects
  (setq eglot-events-buffer-size 0)  ; Disable logging for performance
  (setq eglot-connect-timeout 120)
  (setq eglot-sync-connect nil))

;; Note: Built-in eglot respects .gitignore automatically,
;; so no need to manually configure ignored directories

;; formatting
(use-package apheleia
  :ensure (apheleia
           :host github
           :repo "raxod502/apheleia")
  :custom
  ;; Defer indentation decisions to project formatter config (e.g. .prettierrc).
  (apheleia-formatters-respect-indent-level nil)
  :hook (elpaca-after-init . apheleia-global-mode))

;; Project root detection
(setq project-vc-extra-root-markers '(".git" "package.json" "tsconfig.json"))

;; Generic project/search keybindings
(global-set-key (kbd "C-c p") #'project-switch-project)
(global-set-key (kbd "C-c s") #'consult-ripgrep)
(global-set-key (kbd "C-c a") #'xref-find-definitions)
(global-set-key (kbd "C-c u") #'project-find-regexp)
(global-set-key (kbd "C-c j") #'project-dired)
(global-set-key (kbd "C-c t") #'project-find-file)
(global-set-key (kbd "C-c r") #'consult-project-buffer)
