emacs/.config/emacs/config.org
* Miscellaneous Utilities

#+begin_src emacs-lisp :tangle "init.el"
  (use-package autoinsert
    :ensure nil
    :hook (find-file . auto-insert))

  ;;;; misc functions
  (defun find-user-config-file ()
    "Edit the config file, in another window."
    (interactive)
    (find-file-other-window (expand-file-name "config.org" user-emacs-directory)))

  (define-key goto-map "I" 'find-user-config-file)

  (defun kill-other-buffers ()
    "Kill all buffers but the current one.
  Doesn't mess with special buffers."
    (interactive)
    (when (y-or-n-p "Are you sure you want to kill all buffers but the current one? ")
      (seq-each
       #'kill-buffer
       (delete (current-buffer) (seq-filter #'buffer-file-name (buffer-list))))))

  (define-key ctl-x-map "K" 'kill-other-buffers)

  (defun am/show-emacs-cheatsheet ()
    "Show the Emacs command cheat sheet in a pinned side window."
    (interactive)
    (let* ((file "/Users/ananthmadhavan/Code/emacs-commands-cheatsheet.md")
           (buffer (find-file-noselect file))
           (window (display-buffer-in-side-window
                    buffer
                    '((side . right)
                      (slot . 0)
                      (window-width . 0.33)))))
      (with-current-buffer buffer
        (read-only-mode 1)
        (visual-line-mode 1)
        (when (fboundp 'markdown-view-mode)
          (markdown-view-mode 1)))
      (set-window-dedicated-p window t)
      (select-window window)))

  (global-set-key (kbd "C-c e") #'am/show-emacs-cheatsheet)

  ;; bring all the LLMs to emacs
  (use-package gptel
    :custom (gptel-default-mode 'org-mode)
    :config
    (setq gptel-api-key (string-trim
                         (shell-command-to-string
                          "op read 'op://Personal/OpenAI/notes'")))
    (gptel-make-anthropic "Claude"
      :stream t
      :key (string-trim
            (shell-command-to-string
             "op read 'op://Personal/Anthropic/credential'")))
    (gptel-make-openai "DeepSeek"
      :host "api.deepseek.com"
      :endpoint "/chat/completions"
      :stream t
      :key (string-trim
            (shell-command-to-string
             "op read 'op://Personal/DeepSeek/credential'"))
      :models '(deepseek-chat deepseek-coder))
    :bind
    (:map mode-specific-map
          ("RET" . gptel-send)))

  ;;; init.el ends here
#+end_src

* Keybinding Reference & Tutorial

Press ~M-g i~ and search for "Keybinding" to jump to this section anytime.

** Navigation (Find files, switch projects, jump)

| Key          | Command                        | Description                              |
|--------------+--------------------------------+------------------------------------------|
| C-x p p      | project-switch-project         | Switch to any known project             |
| C-c p        | project-switch-project         | Switch to a known project               |
| C-x p f      | project-find-file              | Find file in current project            |
| C-x b        | consult-buffer                 | Switch buffer with live preview         |
| C-c j        | project-dired                  | Open current project root in dired      |
| M-g i        | consult-imenu                  | Jump to function/class in file          |
| M-g M-g      | avy-goto-line                  | Jump to any line on screen              |
| C-j          | avy-goto-char-timer            | Jump to any character                   |
| M-g g        | consult-goto-line              | Go to line number                       |

** Search (Code search, find symbols)

| Key          | Command                        | Description                              |
|--------------+--------------------------------+------------------------------------------|
| C-s          | consult-line                   | Search in current buffer (live)         |
| M-s s        | consult-ripgrep                | Search in current project               |
| C-c s        | consult-ripgrep                | Search with ripgrep                     |
| C-c a        | xref-find-definitions          | Jump to definition                      |
| C-c u        | project-find-regexp            | Search regex in project                 |
| C-c r        | consult-project-buffer         | Switch buffer in current project        |

** LSP / Code Intelligence (eglot)

| Key          | Command                        | Description                              |
|--------------+--------------------------------+------------------------------------------|
| M-.          | xref-find-definitions          | Go to definition                        |
| M-?          | xref-find-references           | Find all references                     |
| M-,          | xref-go-back                   | Go back after jumping                   |
| C-c l s      | consult-eglot-symbols          | Search symbols in workspace             |
| C-c l r      | eglot-rename                   | Rename symbol everywhere                |
| C-c l a      | eglot-code-actions             | Show code actions                       |
| C-c l o      | eglot-code-action-organize-imports | Organize imports              |
| C-c l f      | eglot-format                   | Format current buffer                   |
| C-c l h      | eldoc-box-help-at-point        | Show documentation popup                |

** Editing & Completion

| Key          | Command                        | Description                              |
|--------------+--------------------------------+------------------------------------------|
| TAB          | completion-at-point            | Trigger completion                      |
| C-=          | er/expand-region               | Expand selection semantically           |
| C-_          | er/contract-region             | Contract selection                      |
| M-RET        | mc/edit-lines                  | Multiple cursors on lines               |
| C-z          | goto-last-change               | Jump to last edit location              |
| M-;          | smart-comment                  | Smart comment/uncomment                 |

** Git (magit, blame, history)

| Key          | Command                        | Description                              |
|--------------+--------------------------------+------------------------------------------|
| C-c m s      | magit-status                   | Git status (main interface)             |
| C-c m b      | magit-blame                    | Git blame current file                  |
| C-c m l      | magit-log                      | Git log                                 |
| C-c g t      | git-timemachine                | Browse file history                     |
| C-c g b      | blamer-mode                    | Toggle inline git blame                 |

** Windows & Workspaces

| Key          | Command                        | Description                              |
|--------------+--------------------------------+------------------------------------------|
| M-o          | ace-window                     | Switch windows with hints               |
| C-c d        | dired-sidebar-toggle-sidebar   | Toggle file tree sidebar                |
| C-c w n      | tab-bar-new-tab                | New workspace tab                       |
| C-c w c      | tab-bar-close-tab              | Close current tab                       |
| C-c w r      | tab-bar-rename-tab             | Rename tab                              |

** Error Navigation

| Key          | Command                        | Description                              |
|--------------+--------------------------------+------------------------------------------|
| C-c ! n      | flymake-goto-next-error        | Jump to next error                      |
| C-c ! p      | flymake-goto-prev-error        | Jump to previous error                  |
| C-c ! l      | consult-flymake                | List all errors with preview            |

** Help & Documentation

| Key          | Command                        | Description                              |
|--------------+--------------------------------+------------------------------------------|
| C-h f        | describe-function              | View function documentation             |
| C-h v        | describe-variable              | View variable documentation             |
| C-h k        | describe-key                   | What does key do?                       |
| M-g I        | find-user-config-file          | Open config.org                         |

** File & Buffer Management

| Key          | Command                        | Description                              |
|--------------+--------------------------------+------------------------------------------|
| C-x C-f      | find-file                      | Open file                               |
| C-x C-s      | save-buffer                    | Save current file                       |
| C-x k        | kill-buffer                    | Close buffer                            |
| C-x K        | kill-other-buffers             | Close all except current                |
| C-c t        | project-find-file              | Find file in current project            |

* Footnotes

This configuration is maintained as a literate program in Org mode.
For questions or improvements, edit this file directly and re-tangle.

Generated files (=init.el= and =early-init.el=) should NEVER be edited manually.

#+begin_quote
Happy coding! 🚀
#+end_quote
