emacs/.config/emacs/init.el

(use-package autoinsert
  :ensure nil
  :hook (find-file . auto-insert))

;;;; misc functions
(defun find-user-config-file ()
  "Edit the config file, in another window."
  (interactive)
  (find-file-other-window (expand-file-name "config.org" user-emacs-directory)))

(define-key goto-map "I" 'find-user-config-file)

(defun kill-other-buffers ()
  "Kill all buffers but the current one.
Doesn't mess with special buffers."
  (interactive)
  (when (y-or-n-p "Are you sure you want to kill all buffers but the current one? ")
    (seq-each
     #'kill-buffer
     (delete (current-buffer) (seq-filter #'buffer-file-name (buffer-list))))))

(define-key ctl-x-map "K" 'kill-other-buffers)

(defun am/show-emacs-cheatsheet ()
  "Show the Emacs command cheat sheet in a pinned side window."
  (interactive)
  (let* ((file "/Users/ananthmadhavan/Code/emacs-commands-cheatsheet.md")
         (buffer (find-file-noselect file))
         (window (display-buffer-in-side-window
                  buffer
                  '((side . right)
                    (slot . 0)
                    (window-width . 0.33)))))
    (with-current-buffer buffer
      (read-only-mode 1)
      (visual-line-mode 1)
      (when (fboundp 'markdown-view-mode)
        (markdown-view-mode 1)))
    (set-window-dedicated-p window t)
    (select-window window)))

(global-set-key (kbd "C-c e") #'am/show-emacs-cheatsheet)

;; bring all the LLMs to emacs
(use-package gptel
  :custom (gptel-default-mode 'org-mode)
  :config
  (setq gptel-api-key (string-trim
                       (shell-command-to-string
                        "op read 'op://Personal/OpenAI/notes'")))
  (gptel-make-anthropic "Claude"
    :stream t
    :key (string-trim
          (shell-command-to-string
           "op read 'op://Personal/Anthropic/credential'")))
  (gptel-make-openai "DeepSeek"
    :host "api.deepseek.com"
    :endpoint "/chat/completions"
    :stream t
    :key (string-trim
          (shell-command-to-string
           "op read 'op://Personal/DeepSeek/credential'"))
    :models '(deepseek-chat deepseek-coder))
  :bind
  (:map mode-specific-map
        ("RET" . gptel-send)))

;;; init.el ends here
